app/Controllers/BarangController.php

    public function index()
    {
        $model = new BarangModel();
        $barang = $model->findAll();
---
SELECT *
FROM `barangs`

    public function edit($id_barang)
    {
        $model = new BarangModel();
        $barang = $model->where('id_barang', $id_barang)->first();
---
SELECT *
FROM `barangs`
WHERE `id_barang` = '1'
 LIMIT 1